Saved model to disk
Loaded Model from disk
Model: "sequential_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm_1 (LSTM)                (None, 60)                16560     
_________________________________________________________________
dropout_1 (Dropout)          (None, 60)                0         
_________________________________________________________________
dense_1 (Dense)              (None, 1)                 61        
=================================================================
Total params: 16,621
Trainable params: 16,621
Non-trainable params: 0
_________________________________________________________________
None
Shape test X:  (4616, 60, 8)
Shape yhat:  (4616, 1)
Shape test X (reshape):  (4616, 480)
Shape Concatenate:  (4616, 9)
Predicted Y:  [1.3222153 1.2613978 1.2265196 ... 3.0901766 3.132447  3.181344 ]
Actual Y: 
[ 0.  0.  0. ... 10. 10. 10.]
Test RMSE: 2.549
