Model: "sequential_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm_1 (LSTM)                (None, 60)                16560     
_________________________________________________________________
dropout_1 (Dropout)          (None, 60)                0         
_________________________________________________________________
dense_1 (Dense)              (None, 1)                 61        
=================================================================
Total params: 16,621
Trainable params: 16,621
Non-trainable params: 0
_________________________________________________________________
None
Shape test X:  (3592, 60, 8)
Shape yhat:  (3592, 1)
Shape test X (reshape):  (3592, 480)
Shape Concatenate:  (3592, 9)
Predicted Y:  [0.58977646 0.5860102  0.59158236 ... 1.8563144  1.8372437  1.8552747 ]
Actual Y: 
[0.       0.       0.       ... 1.111111 1.111111 1.111111]
Test RMSE: 2.069
