Saved model to disk
Loaded Model from disk
Model: "sequential_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm_1 (LSTM)                (None, 60)                16560     
_________________________________________________________________
dropout_1 (Dropout)          (None, 60)                0         
_________________________________________________________________
dense_1 (Dense)              (None, 1)                 61        
=================================================================
Total params: 16,621
Trainable params: 16,621
Non-trainable params: 0
_________________________________________________________________
None
Shape test X:  (3147, 60, 8)
Shape yhat:  (3147, 1)
Shape test X (reshape):  (3147, 480)
Shape Concatenate:  (3147, 9)
Predicted Y:  [1.1066477 1.0997646 1.0449466 ... 5.87604   5.8806868 5.913043 ]
Actual Y: 
[0. 0. 0. ... 3. 3. 3.]
Test RMSE: 2.435
