Model: "sequential_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm_1 (LSTM)                (None, 60)                16560     
_________________________________________________________________
dropout_1 (Dropout)          (None, 60)                0         
_________________________________________________________________
dense_1 (Dense)              (None, 1)                 61        
=================================================================


None
Shape test X:  (4423, 60, 8)
Shape yhat:  (4423, 1)
Shape test X (reshape):  (4423, 480)
Shape Concatenate:  (4423, 9)
Predicted Y:  [2.0544946 2.073025  2.0705137 ... 8.203848  8.182836  8.133568 ]
Actual Y: 
[ 0.  0.  0. ... 10. 10. 10.]
Test RMSE: 2.722