Saved model to disk
Loaded Model from disk
Model: "sequential_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm_1 (LSTM)                (None, 60)                16560     
_________________________________________________________________
dropout_1 (Dropout)          (None, 60)                0         
_________________________________________________________________
dense_1 (Dense)              (None, 1)                 61        
=================================================================
Total params: 16,621
Trainable params: 16,621
Non-trainable params: 0
_________________________________________________________________
None
Shape test X:  (3455, 60, 8)
Shape yhat:  (3455, 1)
Shape test X (reshape):  (3455, 480)
Shape Concatenate:  (3455, 9)
Predicted Y:  [-0.49535087 -0.46439362 -0.43387595 ...  2.3472087   2.3459723
  2.3179278 ]
Actual Y: 
[0. 0. 0. ... 3. 3. 3.]
Test RMSE: 2.841
